src/cf/maERP_ib/src/Catalogs/УчётныеЗаписиЭлектроннойПочты/УчётныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчётныеЗаписиЭлектроннойПочты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗагружатьВходящие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОдинаковыеДанныеАутентификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПодписи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/maERP_ib/src/Catalogs/УчётныеЗаписиЭлектроннойПочты/ManagerModule.bsl
Функция ПолучитьПоАдресу(Адрес) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	УчётныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.УчётныеЗаписиЭлектроннойПочты КАК УчётныеЗаписиЭлектроннойПочты
	                      |ГДЕ
	                      |	УчётныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты = &Адрес");
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Рез = Запрос.Выполнить();
	Возврат ?(Рез.Пустой(), Справочники.УчётныеЗаписиЭлектроннойПочты.ПустаяСсылка(), Рез.Выгрузить()[0].Ссылка);
КонецФункции

Функция ПолучитьПоФизическомуЛицу(ФизическоеЛицо) Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(УчётныеЗаписиЭлектроннойПочты.Ссылка, Константа.Значение) КАК УчётнаяЗапись
	                      |ИЗ
	                      |	Константа.УчётнаяЗаписьРассылкиСообщенийСистемы КАК Константа
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчётныеЗаписиЭлектроннойПочты КАК УчётныеЗаписиЭлектроннойПочты
	                      |		ПО (УчётныеЗаписиЭлектроннойПочты.ФизическоеЛицо = &ФизическоеЛицо)");
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Возврат Запрос.Выполнить().Выгрузить()[0].УчётнаяЗапись;	
КонецФункции
